Dlubal.RFEM5.IMemberHinge
Interface for working with member hinge

Dlubal.RFEM5.IMemberHinge.GetData
Gets member hinge parameters.
Returns: Member hinge parameters

Dlubal.RFEM5.IMemberHinge.SetData(System.UInt32@)
Sets member hinge parameters.
Hinge: Member hinge parameters.

Dlubal.RFEM5.IMemberHinge.Delete
Deletes member hinge.

Dlubal.RFEM5.IMemberHinge.GetNonlinearity(System.UInt32)
Gets interface for working with member hinge nonlinearity.
Returns: Nonlinearity interface.
Direction: Nonlinearity direction.